'''Виджет Button'''
# Свойства и методы виджетов бывают относительно общими, характерными для многих
# типов, а также частными, зачастую встречающимися только у какого-то одного класса.
# В любом случае список настраиваемых свойств велик. В этом курсе мы будем
# рассматривать только ключевые свойства и методы классов пакета tkinter.
# В Tkinter существует три способа конфигурирования свойств виджетов: в момент
# создания объекта, с помощью метода config(), он же configure(), путем обращения
# к свойству как к элементу словаря.
from tkinter import *

'''Самыми важными свойствами виджета класса Button являются text, с помощью
которого устанавливается надпись на кнопке, и command для установки действия,
то есть того, что будет происходить при нажатии на кнопку. По умолчанию размер
кнопки соответствует ширине и высоте текста, однако с помощью свойств width и
height эти параметры можно изменить. Единицами измерения в данном случае являются
знакоместа. Такие свойства как bg, fg, activebackground и activeforeground
определяют соответственно цвет фона и текста, цвет фона и текста во время нажатия
(и установки курсора мыши над кнопкой).'''

root = Tk()
b1 = Button(text="Изменить", width=15, height=3)

def change():
    b1['text'] = "Изменено"
    b1['bg'] = '#000000'
    b1['activebackground'] = '#555555'
    b1['fg'] = '#ffffff'
    b1['activeforeground'] = '#ffffff'

b1.config(command=change)    # Здесь свойство command устанавливается с помощью метода config().
# Однако можно было сделать и так: b1['command'] = change

b1.pack()
root.mainloop()
