'''Canvas. Идентификаторы'''
'''Изучив размещение геометрических примитивов на экземпляре Canvas, в этом уроке
рассмотрим, как можно обращаться к уже созданным фигурам для изменения их свойств,
а также создадим анимацию.
В Tkinter существует два способа "пометить" фигуры, размещенные на холсте, – это
идентификаторы и теги. Первые всегда уникальны для каждого объекта. Два объекта не
могут иметь одни и тот же идентификатор. Теги не уникальны. Группа объектов на холсте
может иметь один и тот же тег. Это дает возможность менять свойства всей группы.
Отдельно взятая фигура на Canvas может иметь как идентификатор, так и тег.'''

'''Идентификаторы'''
# Методы, создающие фигуры на холсте, возвращают численные идентификаторы этих
# объектов, которые можно присвоить переменным, через которые позднее обращаться к
# созданным фигурам.
from tkinter import *

root = Tk()

c = Canvas(width=300, height=300, bg='white')
c.focus_set()
c.pack()

ball = c.create_oval(140, 140, 160, 160, fill='green')

c.bind('<Up>', lambda event: c.move(ball, 0, -2))
c.bind('<Down>', lambda event: c.move(ball, 0, 2))
c.bind('<Left>', lambda event: c.move(ball, -2, 0))
c.bind('<Right>', lambda event: c.move(ball, 2, 0))

root.mainloop()

'''В данном примере круг двигается по холсту с помощью стрелок на клавиатуре. Когда
создавался круг, его идентификатор был присвоен переменной ball. Метод move() объекта
Canvas принимает идентификатор и смещение по осям.'''

'''С помощью метода itemconfig() можно изменять другие свойства. Метод coords()
устанавливает новые координаты фигуры, если они заданы. Если указывается только
идентификатор или тег, то coords() возвращает текущие координаты.'''

from tkinter import *

root = Tk()

c = Canvas(width=200, height=200, bg='white')
c.pack()

rect = c.create_rectangle(80, 80, 120, 120, fill='lightgreen')

def inFocus(event):
    c.itemconfig(rect, fill='green', width=2)
    c.coords(rect, 70, 70, 130, 130)

c.bind('<FocusIn>', inFocus)

root.mainloop()

# Здесь при получении холстом фокуса (нажать Tab) изменится цвет и размер квадрата.
