'''Entry – однострочное текстовое поле'''
# Текстовые поля предназначены для ввода информации пользователем. Однако нередко
# также для вывода, если предполагается, что текст из них будет скопирован.
# Текстовые поля как элементы графического интерфейса бывают однострочными и
# многострочными. В tkinter вторым соответствует класс Text.
'''Свойства экземпляров Entry во многом схожи с двумя предыдущими виджетами.
А вот методы – нет. Из текстового поля можно взять текст. За это действие
отвечает метод get(). В текстовое поле можно вставить текст методом insert().
Также можно удалить текст методом delete().
Метод insert() принимает позицию, в которую надо вставлять текст, и сам текст.'''
from tkinter import *

root = Tk()

e1 = Entry(width=50)
def insert():
    e1.insert(0, "Tkinter - GUI ")
b = Button(text="Вставить", command=insert)
e1.pack()
b.pack()

# Если 0 в insert() заменить на константу END, то вставляться будет в конец.
# Можно указать любое число-индекс знакоместа, тогда вставка будет производиться
# куда-либо в середину строки.

'''Метод delete() принимает один или два аргумента. В первом случае удаляется один
символ в указанной позиции. Во втором – срез между двумя указанными индексами,
не включая последний. Если нужно полностью очистить поле, то первым аргументом
должен быть 0, вторым – END.'''

root.mainloop()
