'''События'''
'''Обычно, чтобы приложение с графическим интерфейсом что-то делало, должны происходить
те или иные события, чаще всего представляющие собой воздействие человека на элементы GUI.
Можно выделить три основных типа событий: производимые мышью, нажатиями клавиш на
клавиатуре, а также события, возникающие в результате изменения виджетов. Нередко
обрабатываются сочетания. Например, клик мышью с зажатой клавишей на клавиатуре.'''

# При вызове метода bind() событие передается в качестве первого аргумента.
# widget.bind(event, function)

'''Название события заключается в кавычки, а также в угловые скобки < и >. События
описывается с помощью зарезервированных последовательностей ключевых слов.
Часто используемые события, производимые мышью:
<Button-1> – клик левой кнопкой мыши
<Button-2> – клик средней кнопкой мыши
<Button-3> – клик правой кнопкой мыши
<Double-Button-1> – двойной клик левой кнопкой мыши
<Motion> – движение мыши
и т. д.'''

from tkinter import *

def b1(event):
    root.title('Левая кнопка мыши')

def b3(event):
    root.title('Правая кнопка мыши')

def move(event):
    x = event.x
    y = event.y
    s = 'Движение мышью {}x{}'.format(x, y)
    root.title(s)

root = Tk()
root.minsize(width=500, height=400)

root.bind('<Button-1>', b1)
root.bind('<Button-3>', b3)
root.bind('<Motion>', move)

root.mainloop()

'''Событие (event) – это один из объектов tkinter. У событий есть атрибуты, как и у
многих других объектов. В примере в функции move() извлекаются значения атрибутов x
и y объекта event, в которых хранятся координаты местоположения курсора мыши в
пределах виджета, по отношению к которому было сгенерировано событие. В данном
случае виджетом является главное окно, а событием – <Motion>, т. е. перемещение мыши.'''

'''Для событий с клавиатуры буквенные клавиши можно записывать без угловых скобок (например, 'a').
Для неалфавитных клавиш существуют специальные зарезервированные слова. Например,
<Return> - нажатие клавиши Enter, <space>- пробел. (Заметим, что есть событие <Enter>,
которое не имеет отношения к нажатию клавиши Enter, а происходит, когда курсор заходит
в пределы виджета.)
Сочетания пишутся через тире. В случае использования так называемого модификатора, он
указывается первым, детали на третьем месте. Например, <Shift-Up> - одновременное нажатие
клавиш Shift и стрелки вверх, <Control-B1-Motion> – движение мышью с зажатой левой
кнопкой и клавишей Ctrl.'''

from tkinter import *

def exitWin(event):
    root.destroy()

def inLabel(event):
    t = ent.get()
    lbl.configure(text=t)

def selectAll(event):
    root.after(10, select_all, event.widget)

def select_all(widget):
    widget.selection_range(0, END)
    widget.icursor(END)    # курсор в конец

root = Tk()

ent = Entry(width=40)
ent.focus_set()
ent.pack()
lbl = Label(height=3, fg='orange', bg='darkgreen', font="Verdana 24")
lbl.pack(fill=X)

ent.bind('<Return>', inLabel)
ent.bind('<Control-a>', selectAll)
root.bind('<Control-q>',exitWin)

root.mainloop()

'''Здесь сочетание клавиш Ctrl+a выделяет текст в поле. Без root.after() выделение
не работает. Метод after() выполняет функцию, указанную во втором аргументе, через
промежуток времени, указанный в первом аргументе. В третьем аргументе передается
значение атрибута widget объекта event. В данном случае им будет поле ent. Именно
оно будет передано как аргумент в функцию select_all() и присвоено параметру widget.'''
