'''Виджет Label просто отображает текст в окне и служит в основном для информационных
целей (вывод сообщений, подпись других элементов интерфейса). Свойства метки во
многом схожи с таковыми у кнопки. Однако у меток нет опции command. Клик по метке
не обрабатывается Tkinter. На примере объекта типа Label рассмотрим свойство font – шрифт.'''
from tkinter import *

root = Tk()

l1 = Label(text="Машинное обучение", font="Arial 32")
l2 = Label(text="Распознавание образов", font=("Comic Sans MS", 24, "bold"))
l1.config(bd=20, bg='#ffaaaa')
l2.config(bd=20, bg='#aaffff')
l1.pack()
l2.pack()

root.mainloop()

# Значение шрифта можно передать как строку или как кортеж. Второй вариант удобен,
# если имя шрифта состоит из двух и более слов. После названия шрифта можно указать
# размер и стиль.
# Также как font свойство bd есть не только у метки. С его помощью регулируется
# размер границ (единица измерения – пиксель):

'''Бывает, что метки и кнопки не присваивают переменным, если потом к ним в коде не приходится
обращаться. Их создают от класса и сразу размещают:'''
from tkinter import *

def take():
    l['text'] = "Выдано"

root = Tk()
Label(text="Пункт выдачи").pack()
Button(text="Взять", command=take).pack()
l = Label(width=10, height=1)
l.pack()
root.mainloop()

# В данном примере только у одной метки есть связь с переменной, так как одно из ее
# свойств может быть изменено в процессе выполнения программы.
