'''Меню – это виджет, который присутствует во многих пользовательских приложениях.
Находится оно под строкой заголовка и представляет собой выпадающие списки под
словами-пунктами меню. Пункты конечных списков представляют собой команды, обычно
выполняющие какое-либо действия или открывающие диалоговые окна.'''

'''В tkinter экземпляр меню создается от класса Menu, далее его надо привязать к
виджету, на котором оно будет расположено. Обычно таковым выступает главное окно
приложения. Его опции menu присваивается экземпляр Menu через имя связанной с
экземпляром переменной.'''

from tkinter import *

root = Tk()
mainmenu = Menu(root)
root.config(menu = mainmenu)

mainmenu.add_command(label = 'Файл')
mainmenu.add_command(label = 'Справка')

root.mainloop()

'''В данном случае 'Файл' и 'Справка' – это команды. К ним можно добавить опцию
command, связав тем самым с какой-либо функцией-обработчиком клика. Хотя такой
вариант меню имеет право на существование, в большинстве приложений панель меню
содержит выпадающие списки команд, а сами пункты на панели командами по сути не
являются. Клик по ним приводит лишь к раскрытию соответствующего списка.'''

'''В tkinter проблема решается созданием новых экземпляров Menu и подвязыванием
их к главному меню с помощью метода add_cascade().'''

from tkinter import *

root = Tk()

mainmenu = Menu(root)
root.config(menu = mainmenu)

filemenu = Menu(mainmenu, tearoff = 0)
filemenu.add_command(label = 'Открыть...')
filemenu.add_command(label = 'Новый')
filemenu.add_command(label = 'Сохранить...')
filemenu.add_command(label = 'Выход')

helpmenu = Menu(mainmenu, tearoff = 0)
helpmenu.add_command(label = 'Помощь')
helpmenu.add_command(label = 'О программе')

mainmenu.add_cascade(label = 'Файл', menu = filemenu)
mainmenu.add_cascade(label = 'Справка', menu = helpmenu)

root.mainloop()

'''На основное меню (mainmenu), добавляются не команды, а другие меню. У filemenu
и helpmenu в качестве родительского виджета указывается не root, а mainmenu.
Команды добавляются только к дочерним меню. Значение 0 опции tearoff отключает
возможность открепления подменю, иначе его можно было бы делать плавающим кликом
мыши по специальной линии (в случае tearoff=0 она отсутствует).'''
