'''Следующие два свойства – fill (заполнение) и expand (расширение). По-умолчанию
expand равен нулю (другое значение – единица), а fill – NONE (другие значения
BOTH, X, Y). Создадим окно с одной меткой:'''
from tkinter import *

root = Tk()

l1 = Label(bg="lightgreen", width=30, height=10, text="This is a label")
l1.pack(expand=1, fill=BOTH)

root.mainloop()

# Если начать расширять окно или сразу раскрыть его на весь экран, то метка окажется
# вверху по вертикали и в середине по горизонтали. Причина, по которой метка не в
# середине по вертикали заключается в том, что side по-умолчанию равен TOP, и метку
# прибивает к верху.

# Если установить свойство expand в 1, то при расширении окна метка будет всегда в середине

# Свойство fill заставляет виджет заполнять все доступное пространство. Заполнить его
# можно во всех направлениях или только по одной из осей.

'''Последняя опция метода pack() – anchor (якорь) – может принимать
значения N (north – север), S (south – юг), W (west – запад), E (east – восток) и
их комбинации:'''

# l1.pack(expand = 1, anchor = SE)
