'''Checkbutton – флажок'''
# Флажки не требуют установки между собой связи, поэтому может возникнуть вопрос, а
# нужны ли тут переменные Tkinter? Они нужны, чтобы снимать сведения о состоянии
# флажков. По значению связанной с Checkbutton переменной можно определить, установлен
# ли флажок или снят, что в свою очередь повлияет на ход выполнения программы.
# У каждого флажка должна быть своя переменная Tkinter.
from tkinter import *

root = Tk()

cvar1 = BooleanVar()
cvar1.set(0)
c1 = Checkbutton(text="First", variable=cvar1, onvalue=1, offvalue=0)
c1.pack(anchor=W)

cvar2 = BooleanVar()
cvar2.set(0)
c2 = Checkbutton(text="Second", variable=cvar2, onvalue=1, offvalue=0)
c2.pack(anchor=W)

root.mainloop()

'''С помощью опции onvalue устанавливается значение, которое принимает связанная
переменная при включенном флажке. С помощью свойства offvalue – при выключенном.
В данном случае оба флажка будут выключены, так как методом set() были установлены
соответствующие этому значения.
С помощью методов select() и deselect() флажков можно их программно включать и
выключать. То же самое относится к радиокнопкам.'''
