'''Tkinter – это пакет для Python, предназначенный для работы с библиотекой Tk.
Библиотека Tk содержит компоненты графического интерфейса пользователя (graphical
user interface – GUI), написанные на языке программирования Tcl.'''

# Далее, чтобы написать GUI-программу, надо выполнить приблизительно следующее:
# 1) Создать главное окно.
# 2) Создать виджеты и выполнить конфигурацию их свойств (опций).
# 3) Определить события, то есть то, на что будет реагировать программа.
# 4) Определить обработчики событий, то есть то, как будет реагировать программа.
# 5) Расположить виджеты в главном окне.
# 6) Запустить цикл обработки событий.
# Последовательность не обязательно такая, но первый и последний пункты всегда остаются на своих
# местах.

from tkinter import *

root = Tk()    # Объект окна верхнего уровня создается от класса Tk модуля tkinter. Переменную,
# связываемую с объектом, часто называют root (корень):

'''Пусть в окне приложения располагаются текстовое поле (entry), метка (label) и
кнопка (button). Данные объекты создаются от соответствующих классов модуля
tkinter. Мы сразу сконфигурируем некоторые их свойства с помощью передачи аргументов
конструкторам этих классов:'''

e = Entry(root, width=20)
b = Button(root, text="Преобразовать")
l = Label(root, bg='black', fg='white', width=20)

# У функций, которые вызываются при наступлении события с помощью метода bind(), должен быть один
# параметр. Обычно его называют event (событие).
def strToSortlist(event):
    s = e.get()
    s = s.split()
    s.sort()
    l['text'] = ' '.join(s)

b.bind('<Button-1>', strToSortlist)    # связь вызова функции с событием

'''В любом приложении виджеты не разбросаны по окну как попало, а хорошо организованы,
интерфейс продуман до мелочей и обычно подчинен определенным стандартам. Пока
расположим элементы друг за другом с помощью наиболее простого менеджера геометрии
tkinter – метода pack():'''

e.pack()
b.pack()
l.pack()

'''Метод mainloop() объекта Tk запускает главный цикл обработки событий, что в том
числе приводит к отображению главного окна со всеми его причиндалами на экране:'''

root.mainloop()
